Feature: Отримати дані від майстерні 
	As a музикант
	In order to отримати на профіль дані та доступ до точки
	I want to використовувати точку для грання на іструментах.
  
Scenario 1: музикант склав договір на аренду та оплатив її
  Given музикант запросив дані та доступ від точки
    And договір на оренду підписаний
    And договір на оренду верифіковано
    And рахунок на оренду сплачено
   When музикант вибере точку
   Then надсилаємо на його профіль дані
    And надаємо профілю музикант відповідні права на всі системи
    And реєструємо поточний стан точки у системі
    
Scenario 2: музикант запросив доступ без договору та без оплати
  Given музикант запросив дані та доступ від точки
    And договору на оренду не підисано/неіснує
    And рахунок на оренду не сплачено
   When музикант намагається отримати доступ до точки 
   Then відмовляємо в доступі
    And пропонуємо підписати договір
    And пропонуємо сплатити оренду
